## Ejemplo 3: Uniendo `DataFrames` con `merge`

### 1. Objetivos:
    - Tomar una base de datos segmentada y unirla usando el método `merge`
 
---
    
### 2. Desarrollo:

#### a) Conformando un solo `DataFrame` a partir de la información de dos

Ya tenemos todos nuestros conjuntos de datos guardados cada uno en un archivo .csv. Cada uno contiene información que los demás no contienen, así que necesitamos una manera de unirlos para poder *complementar* con un conjunto la información que le hace falta a otro.

Vamos a leer 2 de nuestros datasets:

In [1]:
import pandas as pd

In [2]:
users = pd.read_csv(
    '../../Datasets/MovieLens/users-raw.csv',
    index_col=0, names=['gender', 'age', 'occupation', 'cp'])

In [3]:
users.index.name = 'user_id'

In [4]:
occupations = pd.read_csv(
    'occupations-raw.csv', index_col=0, names=['description'])

In [5]:
occupations.index.name = 'occupation_id'

In [6]:
# examina users
users.head()

         gender  age  occupation     cp
user_id
user_id  gender  age  occupation     cp
1             F    1          10  48067
2             M   56          16  70072
3             M   25          15  55117
4             M   45           7  02460

In [7]:
# examina ocupaciones
occupations.head()

                          description
occupation_id
occupation_id             description
0              other or not specified
1                   academic/educator
2                              artist
3                      clerical/admin

`users` contiene una columna llamada `occupation` que tiene códigos que corresponden a un índice de la tabla `occupations`. Cada código está mapeado a una descripción textual de la ocupación.

Para "jalar" la información textual de las ocupaciones a la tabla `users` hacemos lo siguiente:

In [11]:
users_full = pd.merge(users, occupations, left_on="occupation",
    right_index=True).sort_index()
users_full.head(3)

        gender age occupation     cp          description
user_id
1            F   1         10  48067         K-12 student
10           F  35          1  95370    academic/educator
100          M  35         17  95401  technician/engineer

Ahora podríamos cambiar los nombres de nuestras columnas para que sean más descriptivas:

In [12]:
users_full = users_full.rename(
    columns={"occupation":"occupation_id",
             "description":"occupation"})
users_full.head(3)

        gender age occupation_id     cp           occupation
user_id
1            F   1            10  48067         K-12 student
10           F  35             1  95370    academic/educator
100          M  35            17  95401  technician/engineer

Listo. Ahora tenemos un `DataFrame` que incluye la información de ambos conjuntos de datos. Esto incrementa muchísimo nuestras posibilidades de análisis y visualización.